#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomeLavel_Online

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass HomeLavel_Online.HomeLavel_Online_C
// 0x0030 (0x02E0 - 0x02B0)
class AHomeLavel_Online_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUserWidget*                            OnlineTest;                                        // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CloudSaveState;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            SaveDataGetWait;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         TimeOutCall;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CloudSaveError;                                    // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Rule_C*                            Rule;                                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CheckSave();
	void CloudSaveSyncState(bool Rezult);
	void ExecuteUbergraph_HomeLavel_Online(int32 EntryPoint);
	void InpActEvt_L_K2Node_InputDebugKeyEvent_0(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void OnCallFailed_7D48BD6C414668C163EB8F8DDF93E14A(class FName SessionName, bool bWasSuccessful);
	void OnDestroySessionComplete_7D48BD6C414668C163EB8F8DDF93E14A(class FName SessionName, bool bWasSuccessful);
	void OnSessionInviteReceived(const struct FUniqueNetIdRepl& UserId, const struct FUniqueNetIdRepl& FromId, const class FString& AppId, const struct FOnlineSessionSearchResultBP& InviteResult);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HomeLavel_Online_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HomeLavel_Online_C")
	}
	static class AHomeLavel_Online_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHomeLavel_Online_C>();
	}
};
// DUMPER7_ASSERTS_AHomeLavel_Online_C;

SDK_NAMESPACE_END
