#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrivateOrPublic

#include "Basic.hpp"

#include "UMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_PrivateOrPublic.WBP_PrivateOrPublic_C.ExecuteUbergraph_WBP_PrivateOrPublic
// 0x0030 (0x0030 - 0x0000)
struct WBP_PrivateOrPublic_C_ExecuteUbergraph_WBP_PrivateOrPublic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_cLeonSessionSettings_SearchFriend_C* CallFunc_GoToWidget_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_cLeonSessionSettings_SearchPrivateSession_C* CallFunc_GoToWidget_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_cLeonSessionSettings_SearchPublicSession_C* CallFunc_GoToWidget_ReturnValue_2;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
// DUMPER7_ASSERTS_WBP_PrivateOrPublic_C_ExecuteUbergraph_WBP_PrivateOrPublic;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
