#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReciveInvite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemBlueprints_structs.hpp"
#include "UINavigation_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WBP_ReciveInvite.WBP_ReciveInvite_C
// 0x01F0 (0x06E0 - 0x04F0)
class UWBP_ReciveInvite_C final : public UUINavWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             title;                                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULongTapButton_OnAnimation_C*           LongTapButton_OnAnimation_Join;                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULongTapButton_OnAnimation_C*           LongTapButton_OnAnimation_Ignore;                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FOnlineSessionSearchResultBP           SearchRezult;                                      // 0x0510(0x01B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWidget*                                Root;                                              // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Return;                                            // 0x06D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ReciveInvite_LongTapButton_OnAnimation_Ignore_K2Node_ComponentBoundEvent_1_PushEnd__DelegateSignature();
	void BndEvt__WBP_ReciveInvite_LongTapButton_OnAnimation_Join_K2Node_ComponentBoundEvent_0_PushEnd__DelegateSignature();
	void ExecuteUbergraph_WBP_ReciveInvite(int32 EntryPoint);
	void OnCallFailed_77D215C44210C770FBA086B82A2056BC(class FName SessionName, EOnJoinSessionCompleteResult_ Result);
	void OnJoinSessionComplete_77D215C44210C770FBA086B82A2056BC(class FName SessionName, EOnJoinSessionCompleteResult_ Result);
	void OnReturn();
	void PreConstruct(bool IsDesignTime);
	void SetSessionEvent(const struct FOnlineSessionSearchResultBP& SearchRezult_0, const class FString& UserName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ReciveInvite_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ReciveInvite_C")
	}
	static class UWBP_ReciveInvite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReciveInvite_C>();
	}
};
// DUMPER7_ASSERTS_UWBP_ReciveInvite_C;

SDK_NAMESPACE_END
